Revit 2027 API
BuiltInFailures.RoomFailures.OptionConflictRoomOverlapOption Property
 Option Conflict between Rooms.\nRoom in Option '[Option Name]' overlaps Room in Option '[Option Name]'.\nTo resolve, delete the duplicate Room or divide space with Room Separation Lines in the Main Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OptionConflictRoomOverlapOption { get; }
Public Shared ReadOnly Property OptionConflictRoomOverlapOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OptionConflictRoomOverlapOption {
	FailureDefinitionId^ get ();
}
static member OptionConflictRoomOverlapOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace